Table of Contents
 Enum AnchorType
Namespace
IdeaRS.OpenModel.Parameters
Assembly
IdeaRS.OpenModel.dll
Defines a type of anchor end.
public enum AnchorType
Fields
Straight = 0
Straight end - no washer.
WasherPlateCircular = 1
Circular washer plate.
WasherPlateRectangular = 2
Rectangular washer plate.
Fields
 Name |  Description
 Straight = 0
Straight end - no washer.
 WasherPlateCircular = 1
Circular washer plate.
 WasherPlateRectangular = 2
Rectangular washer plate.
 Edit this page